# Використання функції print() без параметрів
print()

# Виведення на екран числа
print(57)

# Виведення на екран результату додавання
print(1254 + 9123)

# Виведення на екран результат віднімання
print(102983091284098 - 71284828)

# Виведення на екран результату множення
print(3 * 16)

# Виведення на екран результату додавання
print(96 / 2)

# Виведення на екран результату множення
print(7 * 7 * 7 * 7 * 7 * 7 * 7 * 7 * 7)

# Виведення на екран результату зведення числа в ступінь
print(7 ** 9)

# Виведення на екран цілого від поділу
print(21 // 8)

# Виведення на екран залишку від розподілу
print(21 % 8)
