# Користувач вводить з клавіатури пропозицію. Написати функцію, яка друкуватиме на екран останні 3 символи кожного слова


def print_last_three_chars(sentence):
    words = sentence.split()  # розбиваємо речення на слова за пробілами
    for word in words:
        if len(word) <= 3:
            print(word)  # якщо слово має менше або рівно 3 символів, друкуємо його весь
        else:
            print(word[-3:])  # інакше друкуємо останні 3 символи слова

# Приклад використання:
user_input = input("Введіть пропозицію: ")
print_last_three_chars(user_input)


# Ця функція розбиває введену користувачем пропозицію на слова, а потім для кожного слова вона перевіряє його довжину.
# Якщо слово має 3 або менше символів, воно друкується весь. Якщо ж слово має більше 3 символів, друкується останні
# 3 символи цього слова.