# Напишіть генератор, який повертає елементи заданого списку у зворотному порядку (аналог reversed).


def reverse_generator(input_list):
    for index in range(len(input_list) - 1, -1, -1):
        yield input_list[index]

# Приклад використання генератора
my_list = [1, 2, 3, 4, 5]
for element in reverse_generator(my_list):
    print(element)


# У цьому прикладі:
#
# Функція reverse_generator приймає список input_list як аргумент.
# За допомогою циклу for генерує індекси від останнього елемента списку до першого (включно) у зворотному порядку.
# Ключове слово yield повертає елемент списку за поточним індексом.
# При виклику цього генератора з прикладом списку [1, 2, 3, 4, 5], він виведе елементи в порядку: 5, 4, 3, 2, 1.