# Виведіть із списку чисел список квадратів парних чисел. Використовуйте 2 варіанти рішення: генератор та цикл


# Варіант 1: Генератор списків

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# Генератор списків для отримання квадратів парних чисел
squares_even_numbers = [x**2 for x in numbers if x % 2 == 0]

print(squares_even_numbers)


#Варіант 2: Використання циклу

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# Використання циклу для отримання квадратів парних чисел
squares_even_numbers = []
for x in numbers:
    if x % 2 == 0:
        squares_even_numbers.append(x**2)

print(squares_even_numbers)


# Обидва підходи повернуть однаковий результат: список квадратів парних чисел із заданого списку numbers. У даному
# випадку результат буде [4, 16, 36, 64, 100].