# Напишіть програму, яка розв'язує квадратне рівняння 𝑎𝑥 2 + 𝑏𝑥 + 𝑐 = 0 у дійсних числах. На
# відміну від аналогічної вправи з минулого уроку, програма повинна видавати повідомлення про
# відсутність дійсних коренів, якщо значення дискримінанта 𝐷 = 𝑏 2 −4𝑎𝑐 негативне, єдине рішення
# 𝑥 = − 𝑏 / 2𝑎 , якщо він дорівнює нулю, або два корені 𝑥1,2 = −b±D−−√/2a якщо він позитивний.

import math

a = float(input("Введіть a: "))
b = float(input("Введіть b: "))
c = float(input("Введіть c: "))

x = -b / 2 * a

d = b**2 - 4 * a * c
riv = a * (x**2) + b * x + c

x1 = (-b + ((b * b - 4 * a * c) ** 0.5)) / 2
x2 = (-b - ((b * b - 4 * a * c) ** 0.5)) / 2

if d < 0:
    print(f"d не має розв'язку,коли від'ємне, тільки якщо x = -b/2/a, {x}")
    riv = a * (x**2) + b * x + c
    print(riv)

else:
    d >= 0
    print("Рішення є тільки коли x1, x2 позитивні")

    x1 = -b + math.sqrt(d) / 2 * a
    x2 = -b - math.sqrt(d) / 2 * a

    riv1 = a * (x1**2) + b * x1 + c
    riv2 = a * (x2**2) + b * x2 + c

    print(riv1, riv2)
