# Написати програму визначення днів тижня. Дані про день тижня вводяться користувачем з клавіатури.
# Якщо будній день - виводити на екран повідомлення "Сьогодні на роботу", у вихідні дні -
# "Сьогодні вихідний", в інших випадках - "Такого дня не існує".

num = str(input("Введіть день тижня: "))

if num == "Понеділок":
    print("Сьогодні на роботу")
elif num == "Вівторок":
    print("Сьогодні на роботу")
elif num == "Середа":
    print("Сьогодні на роботу")
elif num == "Четвер":
    print("Сьогодні на роботу")
elif num == "П'ятниця":
    print("Сьогодні на роботу")
    
elif num == "Субота":
    print("Сьогодні вихідний")
elif num == "Неділя":
    print("Сьогодні вихідний")
else:
    print("Такого дня не існує")    