# Ще раз розберіть усі приклади до уроку, повторіть теорію та ознайомтеся з документацією щодо розглянутих модулів.


# Функціональне програмування в Python зазвичай охоплює такі основні елементи:
#
# Функції вищих порядків: Функції, які можуть приймати інші функції як аргументи або повертати їх як результат.
#
# Замикання (Closures): Можливість функції зберігати оточення, в якому вона була створена, що дозволяє зберігати стан і змінювати поведінку.
#
# Рекурсія: Виклик функції самої себе, що є потужним інструментом для розв'язання деяких завдань.
#
# Чистота функцій: Функції, які не залежать від стану програми і завжди повертають один і той самий результат для одних і тих же вхідних даних (без побічних ефектів).
#
# Не змінювання стану (Immutability): Програмний підхід, що покликаний зменшити побічні ефекти, заснований на забороні змінювати стан об'єктів після їх створення.
#
# Лямбда-функції: Анонімні функції, які можна створювати на льоту, дозволяють коротше визначення простих функцій без потреби виносити їх в окремі блоки коду.
#
# Функції map, filter, reduce: Вбудовані функції для роботи зі списками, які сприяють функціональному стилю програмування.
#
# Ці елементи дозволяють розробникам писати більш компактний, елегантний і підтримуваний код, використовуючи сильні сторони функціонального програмування.
