# Введення рядка
string = input('Введіть рядок: ')
print('Ви ввели: "', string, '"', sep='')

# Запрошення можна не вказувати:
# # string = input()
# # Результат, який повертає будь-яка функція, можна не прив'язувати до жодного імені.
# # Таким чином, наступний рядок просто змусить # програму чекати, поки користувач щось
# # введе або просто натисне Enter, а потім вона продовжить виконання.
input()

# введемо два числа
n = int(input('Введіть перше число: '))
m = int(input('Введіть друге число: '))
print('{} + {} = {}'.format(n, m, n + m))
print()
print('{0} + {1} = {2}.\nПеревірка: {2} - {1} = {0}'.format(n, m, n + m))
print()
# Аналогічний варіант виводу №1
print(n, "+", m, "=", n + m)
# Аналогічний варіант виводу №2
n = input('Введіть перше число: ')
m = input('Введіть друге число: ')
print(n + " + " + m + " = " + str(int(n) + int(m)))
