x = 2
y = 8

# додавання
print(x + y)
print(x + 3)
# віднімання
print(x - y)
# множення
print(x * y)
# ділення
print(x / y)
# цілочисельне ділення
print(x // y)
# остача від ділення
print(x % y)
# піднесення до ступеня
print(x ** y)
# арифметичний вираз
print(3.2 * 0.8 - 2 * 5 - 3 ** 3)
# піднесення до ступеня, 0.5 – квадратний корінь
print(4 ** 0.5)

z = -2
# модуль числа
print(abs(z))
# квадрат числа
print(pow(z, 2), z ** 2)

m = 3.26234234234
# округлення числа до цілого та до одного знака після коми
print(round(m), round(m, 4))
