# Режими роботи з файлами
file = open("test.txt", "r")  # читання файлу
file = open("test.txt", "w")  # запис файлу, у разі відсутності файлу, його створення, а у разі наявності - обрізання
file = open("test.txt", "a")  # дозапис файлу, у разі відсутності файлу, його створення
file = open("test2.txt", "x")  # відкриття файлу для його ексклюзивного створення, якщо файл існує, операція не
# виконується
file = open("test2.txt", "rb")  # відкриття файлу в бінарному режимі
file = open("test2.txt", "rt")  # відкриття файлу в текстовому режимі (за замовчуванням)
file = open("test2.txt", "r+")  # відкриття файлу для оновлення (читання та запису)

file = open("image.bmp", 'w+b')  # читання та запис файлу в двійковому режимі

file.close()
