# Дано числа a і b (a < b). Виведіть на екран суму всіх натуральних чисел від a до b (включно),
# які є кратними середньому арифметичному цього проміжку.

a = 0
b = 5
for a in range(b):
    a += 1
    print(int((b + a)/b))

