# Створіть програму авторизації, в якій користувачеві дається 3 спроби ввести свої облікові дані
# (логін та пароль). Якщо користувач за меншу кількість спроб ввів вірні дані, програма достроково
# припиняє своє виконання та виводить на екран повідомлення: «Авторизацію успішно пройдено з «№» спроби».


name = "Evgen"
parol = "1234"
a = 1
b = 2
c = 3



login = input("Введіть логін(у вас 3 спроби): ")
if login == name:
    parol1 = input("Введіть пароль: ")
    if parol1 == parol:
        print(f"Авторізацію успішно пройдено з {a} спроби ")
login = input("Введіть логін(у вас 2 спроби): ")
if login == name:
    parol1 = input("Введіть пароль: ")
    if parol1 == parol:
        print(f"Авторізацію успішно пройдено з {b} спроби ")
login = input("Введіть логін(у вас 1 спроба): ")
if login == name:
    parol1 = input("Введіть пароль: ")
    if parol1 == parol:
        print(f"Авторізацію успішно пройдено з {c} спроби ")

else:
    print("У вас закінчились спроби")