# Дано два рядки. Виведіть на екран символи, які є в обох рядках.

lines_a = {'Hello', 1, 2}
lines_b = "Python, best world"
lines_a1 = list(lines_a)
lines_b1 = list(lines_b)
print(lines_a1)
print(lines_b1)