# Простим називається число, яке ділиться націло лише на одиницю і на саме себе. Число 1 не вважається простим.
# Напишіть програму, яка знаходить усі прості числа в заданому проміжку, виводить їх на екран, а потім на вимогу
# користувача виводить їхню суму або добуток.


prime_num = []

for num in range(2, 50):
    if num > 1:
        for i in range(2, int(num**0.5) + 1):
            if (num % i) == 0:
                break
        else:
            prime_num.append(num)
print(f"Prime number{prime_num}")
sum1 = input("Якщо хочете знати суму списку натисніть 1: ")
summ = sum(prime_num)

print(f"Сумма списку: {summ}")
