# Створіть цілочисельний список, введіть кількість його елементів і самі значення. Передбачити меню, в якому: після
# натискання клавіші 1 ці значення виведуться на екран у зворотному порядку, а після натискання
# клавіші 2 – за зростанням.


# int_list = [1, 8, 3, 7, 5, 6, 4, 2, 9, 10]
list = int(
    input(
        "Якщо хочете бачити список у зворотньому порядку натисніть 1\n"
        "Якщо хочете бачити за зростанням натисніть 2\nlist [1, 8, 3, 7, 5, 6, 4, 2, 9, 10]\n"
    )
)

if list == 1:
    int_list = [1, 8, 3, 7, 5, 6, 4, 2, 9, 10]
    int_list.reverse()
    print(int_list)
if list == 2:
    int_list = [1, 8, 3, 7, 5, 6, 4, 2, 9, 10]
    int_list.sort()
    print(int_list)
