# Напишіть програму, яка розв'язує квадратне рівняння 𝑎𝑥2 + 𝑏𝑥 + 𝑐 = 0 за формулами
# 𝑥1,2 =  −𝑏± ((b2−4ac)**0.5)/ 2𝑎 .Значення a, b та c вводяться з клавіатури. Для знаходження кореня використовуйте
# оператор зведення в ступінь,
# а не функцію math.sqrt, щоб отримати комплексні числа у випадку, якщо вираз під коренем негативний.

a = float(input("Введіть a: "))
b = float(input("Введіть b: "))
c = float(input("Введіть c: "))

x1 = (-b + ((b * b - 4 * a * c) ** 0.5)) / 2
x2 = (-b - ((b * b - 4 * a * c) ** 0.5)) / 2

d1 = a * (x1**2) + b * x1 + c
d2 = a * (x2**2) + b * x2 + c


d1 == 0

d2 == 0

print(d1, d2)
