# Створіть програму, яка приймає як формальні параметри зріст і вагу користувача, обчислює індекс маси тіла і в залежності
# від результату повертає інформаційне повідомлення (маса тіла в нормі, недостатня вага або слідкуйте за фігурою).
# Користувач з клавіатури вводить значення росту та маси тіла та передає ці дані у вигляді фактичних параметрів під
# час виклику функції. Програма працює доти, доки користувач не зупинить її комбінацією символів «off»


def calculate_bmi(height, weight):
    bmi = weight / (height / 100) ** 2

    if bmi < 19.5:
        return "Недостатня вага"
    elif 19.5 <= bmi < 25:
        return "Маса тіла в нормі"
    else:
        return "Слідкуйте за фігурою"


while True:
    user_input = (
        input("Введіть ваш зріст та вагу через пробіл (або введіть 'off' для виходу): ")
        .strip()
        .lower()
    )

    if user_input == "off":
        print("Дякую за використання програми. До побачення!")
        break

    try:
        height, weight = map(float, user_input.split())
        result = calculate_bmi(height, weight)
        print("Індекс маси тіла:", result)
    except ValueError:
        print(
            "Некоректний ввід. Будь ласка, введіть зріст та вагу у форматі 'зріст в сантиметрах вага в кілограмах'."
        )
