'''
Можна використовувати модуль як самостійну програму, однак слід пам'ятати, що при імпортуванні модуля його код
виконується повністю, тобто якщо програма щось друкує, то при її імпортуванні це буде надруковано. Цього
можна уникнути, якщо перевіряти, чи запущено скрипт як програму, чи імпортовано. Це можна зробити за допомогою
змінної __name__, яка визначена в будь-якій програмі, і дорівнює "__main__", якщо скрипт запущено як головну
програми, та ім'я, якщо він імпортований. Наприклад:
'''


def hello():
    print('Hello, world!')


def fib(n):
    a = b = 1
    for j in range(n - 2):
        a, b = b, a + b
    return b


if __name__ == "__main__":
    hello()
    for i in range(10):
        print(fib(i))
