# Список – впорядкована послідовність певних значень, які # можуть повторюватися.
# Кількість елементів списку може бути довільною.
# Для створення списку слід записати його елементи через кому в квадратних дужках.

# int_list – список із чотирьох цілих чисел
int_list = [1, 2, 3, 5]
print(int_list)
# char_list – список, що складається із чотирьох символів
char_list = ['a', 'c', 'z', 'x']
print(char_list)

# empty_list – порожній список
empty_list = []
print(empty_list)
empty_list1 = list()
print(empty_list1)

print('Список чисел:', int_list)
print('Список символів:', char_list)
print('Порожній список:', empty_list)
