# Можна отримати групу елементів за їх індексами.
# Ця операція називається зрізом списку (list slicing).

# Створення списку чисел
my_list = [5, 7, 90, 1, 10, 2]

# Отримання зрізу списку від нульового (першого) елемента (включаючи його)
# до третього (четвертого) (не включаючи)
sub_list = my_list[0:3]

# Виведення отриманого списку
print(sub_list)

# Виведення елементів списку від другого до передостаннього
print(my_list[1:-2:])

# Виведення елементів списку від другого до останнього, з кроком 3
print(my_list[1::3])

# Виведення елементів списку від четвертого (п'ятого) до п'ятого (шостого)
print(my_list[4:5])
