# Будь-який із параметрів зрізу можна пропускати
# (За умови дотримання правильної розстановки двокрапок).
# За замовчуванням для початку списку – 0,
# кінця списку - довжина списку, кроку - 1.

# Створення списку чисел
my_list = [5, 7, 9, 1, 1, 2]

# Виведення елементів списку від другого (третього) значення до кінця списку
print(my_list[2:])

# Виведення всіх елементів списку від початку до передостаннього елемента
print(my_list[:-2])

# Виведення всіх елементів списку у зворотному порядку
print(my_list[::-1])
