A = {1, 2, 3, 4, 5}
B = {4, 5, 6, 7, 8}

# Використання оператора |
# Виведення: {1, 2, 3, 4, 5, 6, 7, 8}
print(A | B)

C = {1, 2, 3, 4, 5}
D = {4, 5, 6, 7, 8}
print(C.union(D))
print(D.union(C))
# /=====================/

A = {1, 2, 3, 4, 5}
B = {4, 5, 6, 7, 8}

# Використання оператора &
# Виведення: {4, 5}
print(A & B)

# /=====================/

A = {1, 2, 3, 4, 5}
B = {4, 5, 6, 7, 8}

# Використання оператора - на A
# Виведення: {1, 2, 3}
print(A - B)
print(B - A)
print(A.difference(B))
print(B.difference(A))
set_1 = (A - B) | (B - A)
print(set_1)
set_2 = (A | B) - (A & B)
print(set_2)

# /=====================/

A = {1, 2, 3, 4, 5}
B = {4, 5, 6, 7, 8}

# Використання оператора ^
# Виведення: {1, 2, 3, 6, 7, 8}
print(A ^ B)

# /=====================/

