# Стандартні винятки (або виключення) в Python є вбудованими класами для обробки різних типів помилок
# і ситуацій, що можуть виникнути під час виконання програми. Ось деякі з найбільш поширених стандартних
# винятків у Python:

# SyntaxError: Виникає, коли в програмі виявлено синтаксичну помилку, наприклад, неправильно написаний код.

# IndentationError: Виникає, коли виявлено помилку у відступах, які не відповідають стандартам Python.
#
# NameError: Виникає, коли використовується ідентифікатор, який не був ініціалізований, тобто ім'я змінної
# або функції не визначено.
#
# TypeError: Виникає, коли виконується операція для об'єкта несумісного типу.
#
# IndexError: Виникає, коли спроба доступу до елемента списку, кортежу або іншого індексованого об'єкта
# виходить за межі.
#
# KeyError: Виникає, коли ключ, який використовується для доступу до елемента словника, не знайдений.
#
# ValueError: Виникає, коли функції передається аргумент з правильним типом, але неправильним значенням.
#
# FileNotFoundError: Виникає, коли зазначений файл не знайдений під час операцій з файлами.
#
# ZeroDivisionError: Виникає, коли спроба поділити число на нуль.
#
# TypeError: Виникає, коли функція отримує аргумент несумісного типу.
#
# ImportError: Виникає, коли не вдалося імпортувати модуль або ім'я.
#
# KeyboardInterrupt: Виникає, коли користувач відміняє виконання програми натисканням комбінації клавіш
# (зазвичай Ctrl+C).
#
# Це лише кілька прикладів стандартних винятків, які часто зустрічаються в Python. Кожен з них має свої
# унікальні властивості і може виникати в різних ситуаціях. Вони допомагають програмістам ідентифікувати й обробляти помилки для вдосконалення стійкості і надійності програм.