# Напишіть програму, яка вводить з клавіатури послідовність чисел, перетворює послідовність на кортеж і виводить його
# відсортованим у порядку зростання.


# Введення послідовності чисел з клавіатури
numbers_str = input("Введіть послідовність чисел через пробіл: ")
numbers_list = numbers_str.split()

# Перетворення послідовності на кортеж чисел
numbers_tuple = tuple(map(int, numbers_list))

# Сортування кортежу у порядку зростання
sorted_numbers = sorted(numbers_tuple)

# Виведення відсортованого кортежу
print("Відсортована послідовність чисел:", sorted_numbers)
