# Приклад найпростішого веб-застосунку.
# Він призначений лише для демонстрації створення
# Додатків різних видів. Дані можливості мови Python докладно будуть
# розглянуті в наступних уроках даного курсу та в наступних курсах.

# Для цього прикладу використовується фреймворк Flask (http://flask.pocoo.org)
# Спочатку встановити Flask. Це можна зробити командою в консолі:
# pip install Flask

# Імпортуємо все необхідне з бібліотеки flask
from flask import Flask, request, render_template

# Створюємо об'єкт веб-програми
app = Flask(__name__)


@app.route('/')
def hello_world():          # оголошення функції користувача
    """
    Якщо потрібно оголосити великий рядок (в сенсі рядка в Python)
    з кількох рядків тексту (у звичайному розумінні слова "рядок"),
    то вона обрамляється відразу трьома одинарними чи подвійними лапками
    з обох боків.

    Якщо такий рядок стоїть на самому початку функції, то він грає
    роль особливого виду коментарів – документаційного рядка (docstring).

    Декоратор app.route (про декоратори в курсі Python Essential)
    вказує, що функція буде викликатися, коли користувач
    переходить за певною адресою у браузері.

    Ця функція видаватиме рядок 'Hello World!', коли
    користувач заходить на головну сторінку сайту
    """
    return 'Hello World!'


@app.route('/hello/', methods=['GET', 'POST'])
def hello():
    """
    За адресою http://адрес.сайту/hello/ у нас буде сторінка,
    на якій користувач зможе ввести своє ім'я та отримати привітання.

    Тут ми вказуємо не лише URL-адресу, а й дозволені HTTP-методи.
    Таким чином, за цією адресою можна буде й отримувати сторінку,
    та надсилати дані форми, в якій користувач вводить своє ім'я
    """

    if request.method == 'POST':     # якщо користувач увів своє ім'я
        name = request.form['name']  # то отримуємо його
    else:
        name = None                  # інакше надамо name значення None
    # Після цього віддаємо користувачеві HTML-сторінку на основі шаблону
    # hello_form.html, до якого ми передаємо ім'я користувача
    # (HTML можна вивчити на відповідному курсі з фронтенд-розробки).
    return render_template('hello_form.html', name=name)


@app.route('/<name>')
def hello_buddy(name):
    """
    Будь-яку іншу адресу ми вважаємо ім'ям користувача
    та видаємо відповідне вітання.
    """
    return 'Hello, ' + name + '!'


# Якщо цей файл був запущений як головний, а не імпортований
# з іншого модуля, то запускаємо сервер веб-програми.
# За замовчуванням він буде доступний за адресою http://localhost:5000/
if __name__ == '__main__':
    app.run()
